app/views/events/_event.json.jbuilder

UPDATE "events" SET "start" = ?, "end" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start", 2017-04-04 00:00:00 UTC], ["end", 2017-04-07 00:00:00 UTC], ["updated_at", 2017-04-27 03:22:36 UTC], ["id", 1]]
---

json.update_url event_path(event, method: :patch)