app/controllers/events_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? ORDER BY "clients"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE ((("events"."client_id" = ? OR "events"."client_id" = ?) OR "events"."client_id" = ?) OR "events"."client_id" = ?)  [["client_id", 3], ["client_id", 3], ["client_id", 4], ["client_id", 10]]
SELECT  "clients".* FROM "clients" INNER JOIN "teacher_client_mappings" ON "clients"."id" = "teacher_client_mappings"."client_id" WHERE "teacher_client_mappings"."teacher_id" = ? ORDER BY "clients"."id" ASC LIMIT ?  [["teacher_id", 2], ["LIMIT", 1]]
---
  def index

    if current_teacher and current_teacher.admin and params[:client_id]!=nil

      client=Client.find(params[:client_id])
     @events=client.events.all
     gon.my_var=@events
    # render json:@events.as_json()
     #return redirect_to root_path
       # index.html.erb
    end

    if current_client
    @events=current_client.events.all
   end

   if current_teacher and @events==nil

   @events=current_teacher.clients.all.first.events.all

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
---
  def show

    if current_teacher and current_teacher.admin and params[:client_id]!=nil

      client=Client.find(params[:client_id])
    @events=client.events.all

INSERT INTO "events" ("title", "start", "end", "color", "created_at", "updated_at", "client_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = current_client.events.build(event_params)
    @event.save

UPDATE "events" SET "start" = ?, "end" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start", 2017-04-04 00:00:00 UTC], ["end", 2017-04-07 00:00:00 UTC], ["updated_at", 2017-04-27 03:22:36 UTC], ["id", 1]]
---
  def update
    if(!current_teacher)
    @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    if(!current_teacher)
    @event.destroy